## Read Json File

In [2]:
import pandas as pd
import json

In [3]:
with open("data.json", "r") as file:
    data = json.load(file)

In [4]:
df1=pd.DataFrame(data)
df1.head()

    name  age           city
0  Alice   25       New York
1    Bob   30  San Francisco

## Read CSV

In [6]:
df=pd.read_csv("data1.csv")

In [7]:
df

   Unnamed: 0   name  age           city
0           0  Alice   25       New York
1           1    Bob   30  San Francisco

## Read Parquet file

In [9]:
df_parquet = pd.read_parquet(r"C:\Users\jainm\Downloads\iris.parquet")
df_parquet

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

## Read table from wikipedia page with URL

In [11]:
# Wikipedia page URL
url = "https://en.wikipedia.org/wiki/List_of_states_and_union_territories_of_India_by_number_of_places_of_worship"

# Read all tables from the webpage
tables = pd.read_html(url)

In [12]:
# Display number of tables found
print(f"Total tables found: {len(tables)}")

# Check all tables to find the correct one
for i, table in enumerate(tables):
    print(f"Table {i}:\n", table.head(), "\n\n")

Total tables found: 2
Table 0:
     States and union territories of India ordered by
0  Area Population GDP (per capita) Abbreviations...
1                                                vte


Table 1:
     Rank State / Territory  Number of Places of Worship References
0  India             India                    2366625.0        NaN
1      1     Uttar Pradesh                     265270.0        [1]
2      2       West Bengal                     228452.0        [2]
3      3       Maharashtra                     220458.0        [3]
4      4         Karnataka                    2073367.0        [4]

In [13]:
df=tables[1]
df.head()

    Rank State / Territory  Number of Places of Worship References
0  India             India                    2366625.0        NaN
1      1     Uttar Pradesh                     265270.0        [1]
2      2       West Bengal                     228452.0        [2]
3      3       Maharashtra                     220458.0        [3]
4      4         Karnataka                    2073367.0        [4]